tests/Fixtures/Saloon/Payments/fetch-a-list-of-payments.json

{"statusCode":200,"headers":{"Date":"Fri, 05 Jan 2024 14:40:14 GMT","Content-Type":"application\/json","Content-Length":"612","Connection":"keep-alive","x-ratelimit-remaining-minute":"999","ratelimit-limit":"1000","ratelimit-remaining":"999","ratelimit-reset":"46","x-ratelimit-limit-minute":"1000","x-total-count":"1","x-limit":"500","x-offset":"0","Cache-Control":"no-store","pragma":"no-cache","vary":"Origin","access-control-allow-origin":"https:\/\/office.bexio.com","via":"1.1 google","alt-svc":"h3=\":443\"; ma=86400","CF-Cache-Status":"DYNAMIC","Server":"cloudflare","CF-RAY":"840c79a6ea3b638b-LHR"},"data":"[{\"id\":1,\"uuid\":\"6d12ada0-b043-48fa-8101-a23f29134764\",\"type\":\"iban\",\"bank_account\":{\"id\":1,\"iban\":\"CH3489144588477817417\"},\"payment\":{\"instructed_amount\":{\"currency\":\"CHF\",\"amount\":100},\"recipient\":{\"name\":\"M\\u00fcller GmbH\",\"street\":\"Sonnenstrasse\",\"house_number\":\"36\",\"zip\":\"8005\",\"city\":\"Z\\u00fcrich\",\"country_code\":\"CH\"},\"execution_date\":\"2024-01-08\",\"is_editing_restricted\":false,\"bill_id\":null,\"iban\":\"CH8100700110005554634\",\"message\":\"Rechnung 1234\",\"is_salary_payment\":false,\"allowance_type\":\"no_fee\"},\"instruction_id\":\"6597ee4aa82400.43907765\",\"status\":\"open\",\"created_at\":\"2024-01-05T12:55:54+01:00\"}]"}